package Day04_;

public class Ex07_02 {

	public static void main(String[] args) {
		/*
		 * 1부터 100 사이의 합을 구하여 10 단위마다 한 번씩 출력하시오. (Ex07_02 .java -> for, if, % (나머지연산))
		 * 
		 * 1 ~ 10 까지의합 -> 55 1 ~ 20 까지의합 -> 210 1 ~ 30 까지의합 -> 465 1 ~ 40 까지의합 -> 820 1
		 * ~ 50 까지의합 -> 1275 1 ~ 60 까지의합 -> 1830 1 ~ 70 까지의합 -> 2485 1 ~ 80 까지의합 -> 3240
		 * 1 ~ 90 까지의합 -> 4095 1 ~ 100 까지의합 -> 5050
		 */
		
		
		int sum = 0; //누적합
		
		for(int i = 1; i <= 100; i++) {
			sum += i;
			
			if( i % 10 == 0) { //10의 배수일 때 실행 => 10, 20, 30...
				System.out.printf("1 ~ %d 까지의 합 -> %d \n", i, sum);
			}
		} 
	}

}
